app/controllers/songs_controller.rb

  def show
    @song = Song.find_by(params[:id])
    if Song.exists?(params[:id])
      @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]